# CreateTexture

## Description
Function CreateTexture creates a new texture object with default values.

```pascal
FUNCTION CreateTexture : HANDLE;
```

```python
def vs.CreateTexture():
    return HANDLE
```

## Remarks
Creates a new texture object handle with default values

## Version
Availability: from VectorWorks8.0

## Category
* Textures